software-engineering-starter-web-03.html
---
layout: default
title: Software Engineering - Starter Web app 3
date: 2018-07-10
categories: software-engineering
parent: software-engineering-starter-web.org
---
<p>
This is the third installment of this <a href="./software-engineering-starter-web.html">Starter Web App</a> series I&rsquo;m doing. In
<a href="./software-engineering-starter-web-02.html">part 2</a> we made our app server respond with different formats based on headers
the client sends. Now we&rsquo;re going to use dynamic data!
</p>

<p>
If you&rsquo;re still on lesson 2, this will be cheating to continue. Spoiler alert!
</p>

<p>
This is about what we should have had from lesson 2.
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #51afef;">const</span> <span style="color: #DFDFDF;">express</span> = require<span style="color: #51afef;">(</span><span style="color: #7bc275;">'express'</span><span style="color: #51afef;">)</span>
<span style="color: #51afef;">const</span> <span style="color: #DFDFDF;">app</span> = express<span style="color: #51afef;">()</span>

app.get<span style="color: #51afef;">(</span><span style="color: #7bc275;">'/'</span>, <span style="color: #C57BDB;">(</span>req, res<span style="color: #C57BDB;">)</span> =&gt; <span style="color: #C57BDB;">{</span>
  <span style="color: #51afef;">if</span><span style="color: #7bc275;">(</span>req.accepts<span style="color: #a991f1;">(</span><span style="color: #7bc275;">'text/html'</span><span style="color: #a991f1;">)</span><span style="color: #7bc275;">)</span> <span style="color: #7bc275;">{</span>
    res.set<span style="color: #a991f1;">(</span><span style="color: #7bc275;">'Content-Type'</span>, <span style="color: #7bc275;">'text/html'</span><span style="color: #a991f1;">)</span>
    res.send<span style="color: #a991f1;">(</span><span style="color: #7bc275;">'\</span>
<span style="color: #7bc275;">     &lt;html&gt;\</span>
<span style="color: #7bc275;">       &lt;body&gt;\</span>
<span style="color: #7bc275;">         Welcome to the official site for &lt;em&gt;justified&lt;/em&gt;\</span>
<span style="color: #7bc275;">         &lt;strong&gt;cat hatred&lt;/strong&gt;.\</span>
<span style="color: #7bc275;">       &lt;/body&gt;\</span>
<span style="color: #7bc275;">     &lt;/html&gt;'</span><span style="color: #a991f1;">)</span>
  <span style="color: #7bc275;">}</span> <span style="color: #51afef;">else</span> <span style="color: #7bc275;">{</span>
    res.set<span style="color: #a991f1;">(</span><span style="color: #7bc275;">'Content-Type'</span>, <span style="color: #7bc275;">'text/plain'</span><span style="color: #a991f1;">)</span>
    res.send<span style="color: #a991f1;">(</span><span style="color: #7bc275;">'ohai'</span><span style="color: #a991f1;">)</span>
  <span style="color: #7bc275;">}</span>
<span style="color: #C57BDB;">}</span><span style="color: #51afef;">)</span>

app.listen<span style="color: #51afef;">(</span><span style="color: #e69055; font-weight: bold;">3000</span>, <span style="color: #C57BDB;">()</span> =&gt; console.log<span style="color: #C57BDB;">(</span><span style="color: #7bc275;">'Example app listening on port 3000!'</span><span style="color: #C57BDB;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<div id="outline-container-providing-data" class="outline-2">
<h2 id="providing-data"><span class="section-number-2">1.</span> providing data</h2>
<div class="outline-text-2" id="text-providing-data">
<p>
Let&rsquo;s add an endpoint (request handler) that gets us a list of cats. We&rsquo;re going
to model our endpoints after REST. I have a post that gives a very high level
overview of REST, which you can read but isn&rsquo;t required to move forward. The
real basic gist is that with REST, our endpoints are modeled as noun-like
things, and we have a very small number of fixed verb-like things we can do with
the noun-like things.
</p>

<p>
Our endpoint for cats will simply be <code>/cats</code>.
</p>

<div class="org-src-container">
<pre class="src src-js">  app.get<span style="color: #51afef;">(</span><span style="color: #7bc275;">'/cats'</span>, <span style="color: #C57BDB;">(</span>req, res<span style="color: #C57BDB;">)</span> =&gt; <span style="color: #C57BDB;">{</span>
    res.send<span style="color: #7bc275;">(</span><span style="color: #a991f1;">[</span>
      <span style="color: #7bc275;">'Chester'</span>,
      <span style="color: #7bc275;">'Foof'</span>,
      <span style="color: #7bc275;">'Garfield'</span>,
      <span style="color: #7bc275;">'Hobbes'</span>,
      <span style="color: #7bc275;">'Puss'</span>,
      <span style="color: #7bc275;">'Tom'</span>,
      <span style="color: #7bc275;">'Tony'</span>,
      <span style="color: #7bc275;">'Whiskers'</span>,
    <span style="color: #a991f1;">]</span><span style="color: #7bc275;">)</span>
  <span style="color: #C57BDB;">}</span><span style="color: #51afef;">)</span>
</pre>
</div>

<p>
Doing a <code>GET</code> on <code>/cats</code> will provide a JSON list of cat names back. These are
all very legitimate cat names. I checked.
</p>

<p>
Let&rsquo;s fire our server up and verify we can actually see these.
</p>

<div class="org-src-container">
<pre class="src src-shell">$ <span style="color: #FCCE7B;">curl</span> http://localhost:3000/cats
<span style="color: #51afef;">[</span><span style="color: #7bc275;">"Chester"</span>,<span style="color: #7bc275;">"Foof"</span>,<span style="color: #7bc275;">"Garfield"</span>,<span style="color: #7bc275;">"Hobbes"</span>,<span style="color: #7bc275;">"Puss"</span>,<span style="color: #7bc275;">"Tom"</span>,<span style="color: #7bc275;">"Tony"</span>,<span style="color: #7bc275;">"Whiskers"</span><span style="color: #51afef;">]</span>
</pre>
</div>

<p>
Whoa, it&rsquo;s like the <span class="underline">exact</span> same set of strings we passed to <code>res.send</code>! Spooky.
</p>
</div>
</div>

<div id="outline-container-making-the-data-easy-to-change" class="outline-2">
<h2 id="making-the-data-easy-to-change"><span class="section-number-2">2.</span> making the data easy to change</h2>
<div class="outline-text-2" id="text-making-the-data-easy-to-change">
<p>
Okay let&rsquo;s get rid of &ldquo;Foof&rdquo; because I only know one person who has a Foof cat
and while that&rsquo;s kind of neat name it&rsquo;s pretty dumb of me to treat that as
data. We&rsquo;ll change &ldquo;Foof&rdquo; to &ldquo;Mr. Druthersworth&rdquo; because that&rsquo;s a badass cat
name.
</p>

<p>
I&rsquo;ll wait until you get that done and test it with <code>curl</code>. Don&rsquo;t forget to
restart the node process when you make a change!
</p>

<p>
This is pretty stupid. Any time we want to change the data, we have to change
our program and restart it. That&rsquo;s because we&rsquo;re not really changing data.
We&rsquo;re changing (source) code. To make it use real data, we should read it from
a data source.
</p>
</div>

<div id="outline-container-making-the-data-easy-to-change--fs" class="outline-3">
<h3 id="making-the-data-easy-to-change--fs"><span class="section-number-3">2.1.</span> fs</h3>
<div class="outline-text-3" id="text-making-the-data-easy-to-change--fs">
<p>
<code>fs</code> is a module built into Node.js that handles interacting with the file
system (hence &ldquo;fs&rdquo;). Computers are mostly fancy machines that present files.
<b>Remember this</b>. We&rsquo;re going to put our cat name list into a file.
</p>

<p>
Let&rsquo;s make a JSON file. JSON stands for JavaScript Object Notation. The
format that JSON uses isn&rsquo;t actually JavaScript but it&rsquo;s very close. It&rsquo;s
incredibly picky compared to JavaScript. Notably different from what we&rsquo;ve
written thus far, it can&rsquo;t use single quotes (everything is double quoted if
it&rsquo;s a string), and there can be no trailing comma. A trailing comma is a
comma presented at the end of some comma separated sequence. Trailing commas
are boss because you don&rsquo;t have to think about making sure you remove that
last comma or adding one should you rearrange a list. But we&rsquo;re doing JSON so
fuck you. One last notable thing about JSON is that you can copy and paste
JSON directly into JavaScript and it will parse just fine. Not all JavaScript
works as JSON though.
</p>

<div class="org-src-container">
<pre class="src src-json">   <span style="color: #51afef;">[</span>
    <span style="color: #7bc275;">"Chester"</span>,
    <span style="color: #7bc275;">"Mr. Druthersworth"</span>,
    <span style="color: #7bc275;">"Garfield"</span>,
    <span style="color: #7bc275;">"Hobbes"</span>,
    <span style="color: #7bc275;">"Puss"</span>,
    <span style="color: #7bc275;">"Tom"</span>,
    <span style="color: #7bc275;">"Tony"</span>,
    <span style="color: #7bc275;">"Whiskers"</span>
   <span style="color: #51afef;">]</span>
</pre>
</div>

<p>
Wow, this looks like the <span class="underline">exact</span> same thing our <code>curl</code> output has, except
broken into multiple lines! That&rsquo;s because it is. The line breaks are not of
consequence so long as it doesn&rsquo;t happen inside a string. Let&rsquo;s save this
file as <code>cats.json</code>.
</p>

<p>
Now we&rsquo;ll make our server load this file. First, we&rsquo;ll need to require <code>fs</code>.
Instead of giving you the syntax this time, I&rsquo;m going to let you look it up.
The JS file you have right now has a great <code>require</code> example. My suggestion
is to keep your <code>require</code> calls all in the same spot, and towards the top of
the file before real logic begins. This part isn&rsquo;t critical, but I find it
easier to find my way around: I sort the statements alphabetically. So the
<code>require</code> call for <code>express</code> would come before <code>fs</code>. It makes things easier
to find. Some engineers like to group things together loosely by some kind of
arbitrary association (here goes the web things, here goes the file things,
etc), but these loose associations don&rsquo;t actually communicate anything and
rarely do things fall into such nice and neat buckets.
</p>

<p>
Now that we have <code>fs</code>, we can call <code>fs.readFile</code>. <code>readFile</code> takes a path to
a file, optional options (as in you don&rsquo;t need to provide the options, they
are optional&#x2026;), and a callback. The callback is a function we give
<code>readFile</code>, and <code>readFile</code> itself will call this function once the file has
been loaded. The function is supposed to take an error and data as two
parameters. That&rsquo;s a pretty simple rundown of the function. You can see more
details from the <a href="https://nodejs.org/api/fs.html#fs_fs_readfile_path_options_callback">documentation on readFile here</a> if you like, but we can go
with my summary for now. For the path, we will use a relative path of
<code>'./cats.json'</code>. For the options, we can give it <code>'utf8'</code>. The callback
needs to take an <code>error</code> and <code>data</code> parameters. If <code>readFile</code> was successful,
<code>error</code> will be <code>null</code>. This is an exercise I will leave for you. The
documentation has an example of how to use the callback. Be sure this code
goes inside of your <code>get</code> handler. This is because we need it to re-run the
file load every time we get a request. We can save the file and it will cause
a reload of the file. We won&rsquo;t need to restart!
</p>

<p>
Once we have the callback setup, we need to do our due diligence and handle
the error condition. Handling errors is not extra stuff - it&rsquo;s part of your
job. Later, we&rsquo;ll go over tricks to make this an automatic process, but for
now it will be a matter of your personal discipline. If there&rsquo;s an error, we
don&rsquo;t want to <code>throw</code> it like the documentation shows. We&rsquo;re going to respond
to the client with an error code. Generally, we can respond with anything in
the 5xx range because loosely the 5xx range means that the server screwed up
somehow. 500 is a general catch all, and we should use that.
</p>

<p>
The general code for sending a 500 looks like this:
</p>

<div class="org-src-container">
<pre class="src src-js">     res.send<span style="color: #51afef;">(</span><span style="color: #e69055; font-weight: bold;">500</span>, <span style="color: #7bc275;">'Could not load cat data!'</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-making-the-data-easy-to-change--parsing" class="outline-3">
<h3 id="making-the-data-easy-to-change--parsing"><span class="section-number-3">2.2.</span> parsing</h3>
<div class="outline-text-3" id="text-making-the-data-easy-to-change--parsing">
<p>
If data loading worked (the <code>error</code> variable is <code>null</code>), we can use it now as
a big string. That&rsquo;s part of what <code>'utf8'</code> gives us. Without it, <code>data</code> would
be a <code>Buffer</code> which is something to look at another day.
</p>

<p>
We&rsquo;re going to take that string and pass it to this global thing that just
hangs around: <code>JSON.parse</code>. <code>JSON</code> is a global variable and <code>parse</code> is a
function on it. <code>parse</code> takes a string and returns an object that the JSON
represents. Pass <code>parse</code> your data, and out will come the cats. You can
then do <code>res.send</code> on the cats.
</p>

<p>
I&rsquo;m intentionally leaving things a little looser here so the work is on your
end. Remember that even though our new setup will let us change the JSON file
without reloading the server, we&rsquo;ll still need to reload the server for any
code changes.
</p>
</div>
</div>
</div>
<div id="outline-container-cheats!" class="outline-2">
<h2 id="cheats!"><span class="section-number-2">3.</span> cheats!</h2>
<div class="outline-text-2" id="text-cheats!">
<p>
I strongly recommend struggling a little bit, but if you get really stuck,
this section below should get you by. Part of the process is figuring this
stuff out as you go. Senior Engineers are constantly googling things and
visiting Stack Overflow for answers, documentation, known issues, etc.
Anything that can help them move past particular problems. There is no shame
in looking stuff up. If you can&rsquo;t use Google, it&rsquo;s honestly a valid reason to
go home for the day. But all that said, sometimes it&rsquo;s time to just ask for
help.
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #51afef;">const</span> <span style="color: #DFDFDF;">express</span> = require<span style="color: #51afef;">(</span><span style="color: #7bc275;">'express'</span><span style="color: #51afef;">)</span>
<span style="color: #51afef;">const</span> <span style="color: #DFDFDF;">fs</span> = require<span style="color: #51afef;">(</span><span style="color: #7bc275;">'fs'</span><span style="color: #51afef;">)</span>
<span style="color: #51afef;">const</span> <span style="color: #DFDFDF;">app</span> = express<span style="color: #51afef;">()</span>

app.get<span style="color: #51afef;">(</span><span style="color: #7bc275;">'/'</span>, <span style="color: #C57BDB;">(</span>req, res<span style="color: #C57BDB;">)</span> =&gt; <span style="color: #C57BDB;">{</span>
  <span style="color: #51afef;">if</span><span style="color: #7bc275;">(</span>req.accepts<span style="color: #a991f1;">(</span><span style="color: #7bc275;">'text/html'</span><span style="color: #a991f1;">)</span><span style="color: #7bc275;">)</span> <span style="color: #7bc275;">{</span>
    res.set<span style="color: #a991f1;">(</span><span style="color: #7bc275;">'Content-Type'</span>, <span style="color: #7bc275;">'text/html'</span><span style="color: #a991f1;">)</span>
    res.send<span style="color: #a991f1;">(</span><span style="color: #7bc275;">'\</span>
<span style="color: #7bc275;">     &lt;html&gt;\</span>
<span style="color: #7bc275;">       &lt;body&gt;\</span>
<span style="color: #7bc275;">         Welcome to the official site for &lt;em&gt;justified&lt;/em&gt;\</span>
<span style="color: #7bc275;">         &lt;strong&gt;cat hatred&lt;/strong&gt;.\</span>
<span style="color: #7bc275;">       &lt;/body&gt;\</span>
<span style="color: #7bc275;">     &lt;/html&gt;'</span><span style="color: #a991f1;">)</span>
  <span style="color: #7bc275;">}</span> <span style="color: #51afef;">else</span> <span style="color: #7bc275;">{</span>
    res.set<span style="color: #a991f1;">(</span><span style="color: #7bc275;">'Content-Type'</span>, <span style="color: #7bc275;">'text/plain'</span><span style="color: #a991f1;">)</span>
    res.send<span style="color: #a991f1;">(</span><span style="color: #7bc275;">'ohai'</span><span style="color: #a991f1;">)</span>
  <span style="color: #7bc275;">}</span>
<span style="color: #C57BDB;">}</span><span style="color: #51afef;">)</span>

app.get<span style="color: #51afef;">(</span><span style="color: #7bc275;">'/cats'</span>, <span style="color: #C57BDB;">(</span>req, res<span style="color: #C57BDB;">)</span> =&gt; <span style="color: #C57BDB;">{</span>
  fs.readFile<span style="color: #7bc275;">(</span><span style="color: #7bc275;">'./cats.json'</span>, <span style="color: #7bc275;">'utf8'</span>, <span style="color: #a991f1;">(</span>error, data<span style="color: #a991f1;">)</span> =&gt; <span style="color: #a991f1;">{</span>
    <span style="color: #51afef;">if</span><span style="color: #51afef;">(</span>error<span style="color: #51afef;">)</span> <span style="color: #51afef;">{</span>
      res.send<span style="color: #C57BDB;">(</span><span style="color: #e69055; font-weight: bold;">500</span>, <span style="color: #7bc275;">'Could not load cat data!'</span><span style="color: #C57BDB;">)</span>
    <span style="color: #51afef;">}</span> <span style="color: #51afef;">else</span> <span style="color: #51afef;">{</span>
      <span style="color: #51afef;">const</span> <span style="color: #DFDFDF;">cats</span> = JSON.parse<span style="color: #C57BDB;">(</span>data<span style="color: #C57BDB;">)</span>
      res.send<span style="color: #C57BDB;">(</span>cats<span style="color: #C57BDB;">)</span>
    <span style="color: #51afef;">}</span>
  <span style="color: #a991f1;">}</span><span style="color: #7bc275;">)</span>
<span style="color: #C57BDB;">}</span><span style="color: #51afef;">)</span>

app.listen<span style="color: #51afef;">(</span><span style="color: #e69055; font-weight: bold;">3000</span>, <span style="color: #C57BDB;">()</span> =&gt; console.log<span style="color: #C57BDB;">(</span><span style="color: #7bc275;">'Example app listening on port 3000!'</span><span style="color: #C57BDB;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc38f2c2" class="outline-2">
<h2 id="orgc38f2c2"><span class="section-number-2">4.</span> moving on</h2>
<div class="outline-text-2" id="text-4">
<p>
The next part is <a href="./software-engineering-starter-web-04.html">learning about git</a> so you can have both a backup, a log of
changes, and a standard means of sharing your code while also viewing code
others have shared as well.
</p>
</div>
</div>
